             CMD        PROMPT('CleanUp Source')               
             PARM       KWD(PFSRC) TYPE(*CHAR) LEN(10) MIN(1) +
                          PROMPT('File')                       
             PARM       KWD(LIB) TYPE(*CHAR) LEN(10) MIN(1) +  
                          PROMPT('   Library')                 
             PARM       KWD(MBR) TYPE(*CHAR) LEN(10) MIN(1) +  
                          PROMPT('Member')                     
