     <---------------------- Source Specifications ----------------------------><---- Comments ---->
     ....1....+....2....+....3....+....4....+....5....+....6....+....7....+....8....+....9....+...10
     ...............................................................................................
     ... keyed file/keyed acspth ...................................................................
     Line   ....+....1....+....2....+..
            ORDER  ITEM                
     000001  100   1st rcd of 100      
     000002  100   2nd rcd of 100      
     000003  100   3rd rcd of 100      
     000004  102   1st rcd of 102      
     000005  102   2nd rcd of 102      
     000006  102   3rd rcd of 102      
     000007  102   4th rcd of 102      
     000008  103   1st rcd of 103      
     ...............................................................................................
        Dcl-F Testf Keyed;
        order = 102;
        SetLL order TestFr;
        If %Found;         
          DoU %EOF;        
            Dsply item;    
            Read TestFr;   
          EndDo;           
        EndIf;
        *inLR = *On;
        // If Order 102 doesn't exist 
        //DSPLY                
        //DSPLY  1st rcd of 103
     <--------------------------------------------------------------------------------------------->
        Dcl-F Testf Keyed;
        order = 102;
        SetLL order TestFr;
        If %Equal;         
          DoU %EOF;        
            Dsply item;    
            Read TestFr;   
          EndDo;           
        EndIf;
        *inLR = *On;
        // If Order 102 doesn't exist 
        // EOF i.e. no record
     <--------------------------------------------------------------------------------------------->
     <--------------------------------------------------------------------------------------------->
     <--------------------------------------------------------------------------------------------->
     <--------------------------------------------------------------------------------------------->
     <--------------------------------------------------------------------------------------------->
     <--------------------------------------------------------------------------------------------->
     <--------------------------------------------------------------------------------------------->
     <--------------------------------------------------------------------------------------------->
     <--------------------------------------------------------------------------------------------->
     <--------------------------------------------------------------------------------------------->
     <--------------------------------------------------------------------------------------------->
