CRTLIB LIB(OXBLIB) TYPE(*PROD)

/* 121 is the length of the longest command record for file QAUOOPT */
/* 143+12 = 155 */
CRTSRCPF FILE(OXBLIB/QSQLSRC) RCDLEN(155)

/* will fail at first, run this pgm twice */
/* in order to execute the below cmd sucessfully */
RUNSQLSTM SRCFILE(OXBLIB/QSQLSRC) SRCMBR(SRCSQL0)
MONMSG     MSGID(SQL0000 SQL9999)
